set_property IOSTANDARD LVCMOS33 [get_ports {key[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {key[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports euroLed]
set_property IOSTANDARD LVCMOS33 [get_ports fiftyLed]
set_property IOSTANDARD LVCMOS33 [get_ports SellLed]
set_property IOSTANDARD LVCMOS33 [get_ports ReturnLed]
set_property IOSTANDARD LVCMOS33 [get_ports fifty]
set_property IOSTANDARD LVCMOS33 [get_ports euro]
set_property IOSTANDARD LVCMOS33 [get_ports sys_clk]
set_property IOSTANDARD LVCMOS33 [get_ports euroBuffer]
set_property IOSTANDARD LVCMOS33 [get_ports fiftyBuffer]
set_property IOSTANDARD LVCMOS33 [get_ports euroTap]
set_property IOSTANDARD LVCMOS33 [get_ports fiftyTap]
set_property IOSTANDARD LVCMOS33 [get_ports delay_done]
set_property IOSTANDARD LVCMOS33 [get_ports counter_reset]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[10]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[11]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[12]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[13]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[14]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[15]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[16]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[17]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[18]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[19]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[20]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[21]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[22]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[23]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[24]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[25]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[26]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[27]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[28]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[29]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[30]}]
set_property IOSTANDARD LVCMOS33 [get_ports {counter[31]}]

set_property PACKAGE_PIN J1 [get_ports euroLed]
set_property PACKAGE_PIN A13 [get_ports fiftyLed]
set_property PACKAGE_PIN H4 [get_ports sys_clk]
set_property PACKAGE_PIN C3 [get_ports {key[0]}]
set_property PACKAGE_PIN M4 [get_ports {key[1]}]
set_property PACKAGE_PIN B1 [get_ports fifty]
set_property PACKAGE_PIN B2 [get_ports euro]
set_property PACKAGE_PIN A5 [get_ports euroBuffer]
set_property PACKAGE_PIN B6 [get_ports fiftyBuffer]
set_property PACKAGE_PIN H1 [get_ports euroTap]
set_property PACKAGE_PIN A4 [get_ports fiftyTap]
set_property PACKAGE_PIN B5 [get_ports SellLed]
set_property PACKAGE_PIN A3 [get_ports ReturnLed]
set_property PACKAGE_PIN A10 [get_ports delay_done]
set_property PACKAGE_PIN H2 [get_ports counter_reset]
set_property PACKAGE_PIN E4 [get_ports {counter[31]}]
set_property PACKAGE_PIN D4 [get_ports {counter[30]}]
set_property PACKAGE_PIN F3 [get_ports {counter[29]}]
set_property PACKAGE_PIN F2 [get_ports {counter[28]}]
set_property PACKAGE_PIN G1 [get_ports {counter[27]}]
set_property PACKAGE_PIN F1 [get_ports {counter[26]}]
set_property PACKAGE_PIN E2 [get_ports {counter[25]}]
set_property PACKAGE_PIN D2 [get_ports {counter[24]}]
set_property PACKAGE_PIN D1 [get_ports {counter[23]}]
set_property PACKAGE_PIN C1 [get_ports {counter[22]}]
set_property PACKAGE_PIN G4 [get_ports {counter[21]}]
set_property PACKAGE_PIN F4 [get_ports {counter[20]}]
set_property PACKAGE_PIN H3 [get_ports {counter[19]}]
set_property PACKAGE_PIN J2 [get_ports {counter[18]}]
set_property PACKAGE_PIN K4 [get_ports {counter[17]}]
set_property PACKAGE_PIN K3 [get_ports {counter[16]}]
set_property PACKAGE_PIN J4 [get_ports {counter[15]}]
set_property PACKAGE_PIN J3 [get_ports {counter[14]}]
set_property PACKAGE_PIN M1 [get_ports {counter[13]}]
set_property PACKAGE_PIN L1 [get_ports {counter[12]}]
set_property PACKAGE_PIN M3 [get_ports {counter[11]}]
set_property PACKAGE_PIN M2 [get_ports {counter[10]}]
set_property PACKAGE_PIN P2 [get_ports {counter[9]}]
set_property PACKAGE_PIN N1 [get_ports {counter[8]}]
set_property PACKAGE_PIN P4 [get_ports {counter[7]}]
set_property PACKAGE_PIN P3 [get_ports {counter[6]}]
set_property PACKAGE_PIN L3 [get_ports {counter[5]}]
set_property PACKAGE_PIN L2 [get_ports {counter[4]}]
set_property PACKAGE_PIN M5 [get_ports {counter[3]}]
set_property PACKAGE_PIN P5 [get_ports {counter[2]}]
set_property PACKAGE_PIN N4 [get_ports {counter[1]}]
set_property PACKAGE_PIN L5 [get_ports {counter[0]}]

create_clock -period 20.000 -name sys_clk -waveform {0.000 7.500} -add [get_ports sys_clk] 
set_input_delay -clock [get_clocks sys_clk] -min -add_delay 1.500 [get_ports {key[*]}]
set_input_delay -clock [get_clocks sys_clk] -max -add_delay 1.500 [get_ports {key[*]}]
set_output_delay -clock [get_clocks sys_clk] -min -add_delay -0.400 [get_ports euro]
set_output_delay -clock [get_clocks sys_clk] -max -add_delay 0.600 [get_ports euro]
set_output_delay -clock [get_clocks sys_clk] -min -add_delay -0.400 [get_ports euroBuffer]
set_output_delay -clock [get_clocks sys_clk] -max -add_delay 0.600 [get_ports euroBuffer]
set_output_delay -clock [get_clocks sys_clk] -min -add_delay -0.400 [get_ports euroLed]
set_output_delay -clock [get_clocks sys_clk] -max -add_delay 0.600 [get_ports euroLed]
set_output_delay -clock [get_clocks sys_clk] -min -add_delay -0.400 [get_ports euroTap]
set_output_delay -clock [get_clocks sys_clk] -max -add_delay 0.600 [get_ports euroTap]
set_output_delay -clock [get_clocks sys_clk] -min -add_delay -0.400 [get_ports fifty]
set_output_delay -clock [get_clocks sys_clk] -max -add_delay 0.600 [get_ports fifty]
set_output_delay -clock [get_clocks sys_clk] -min -add_delay -0.400 [get_ports fiftyBuffer]
set_output_delay -clock [get_clocks sys_clk] -max -add_delay 0.600 [get_ports fiftyBuffer]
set_output_delay -clock [get_clocks sys_clk] -min -add_delay -0.400 [get_ports fiftyLed]
set_output_delay -clock [get_clocks sys_clk] -max -add_delay 0.600 [get_ports fiftyLed]
set_output_delay -clock [get_clocks sys_clk] -min -add_delay -0.400 [get_ports fiftyTap]
set_output_delay -clock [get_clocks sys_clk] -max -add_delay 0.600 [get_ports fiftyTap]



